#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.module.cosmosdb_sql_container_message_configuration.azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-itn-com-cosno-01"
      + database_name       = "remote-content"
      + id                  = (known after apply)
      + name                = "message-configuration"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/configurationId"
      + partition_key_paths = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.cosmosdb_sql_container_messages_summary.azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-itn-com-cosno-01"
      + database_name       = "data-lake"
      + id                  = (known after apply)
      + name                = "messages-summary"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/year"
      + partition_key_paths = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.cosmosdb_sql_container_remote_content_lease.azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-itn-com-cosno-01"
      + database_name       = "remote-content"
      + id                  = (known after apply)
      + name                = "remote-content-lease"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/id"
      + partition_key_paths = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.cosmosdb_sql_container_user_configuration.azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-itn-com-cosno-01"
      + database_name       = "remote-content"
      + id                  = (known after apply)
      + name                = "user-configuration"
      + partition_key_kind  = "Hash"
      + partition_key_path  = "/userId"
      + partition_key_paths = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.cosmosdb_sql_database_data_lake.azurerm_cosmosdb_sql_database.this will be created
  + resource "azurerm_cosmosdb_sql_database" "this" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = "data-lake"
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.cosmosdb_sql_database_remote_content.azurerm_cosmosdb_sql_database.this will be created
  + resource "azurerm_cosmosdb_sql_database" "this" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = "remote-content"
      + resource_group_name = "io-p-itn-com-rg-01"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = true
      + burst_capacity_enabled                       = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "italynorth"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = "io-p-itn-com-cosno-01"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = false
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "io-p-itn-com-rg-01"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + write_endpoints                              = (known after apply)

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + tier                = "Continuous30Days"
          + type                = "Continuous"
        }

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      + auto_mitigate            = false
      + description              = "A collection throughput (RU/s) exceed provisioned throughput, and it's raising 429 errors. Please, consider to increase RU. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-com-cosno-01] Provisioned Throughput Exceeded"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 1000

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "italynorth",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_private_endpoint.sql will be created
  + resource "azurerm_private_endpoint" "sql" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-com-cosno-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-com-cosno-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "Sql",
            ]
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmos.module.comsosdb_sql_container_messages_ingestion_test.azurerm_cosmosdb_sql_container.this,
  on .terraform/modules/cosmos.comsosdb_sql_container_messages_ingestion_test/cosmosdb_sql_container/main.tf line 7, in resource "azurerm_cosmosdb_sql_container" "this":
   7:   partition_key_path = var.partition_key_path

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 13 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
